# -*- coding: utf-8 -*-
"""test1_Sber_02.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1frCCYeNGOEl1KFt92PTKWV-QuHzdtR8Q

## Тестовое задание

Задача: "Файл «Контроль качества данных python.xlsx» - это файл, который требуется проанализировать на предмет качества данных с помощью питоновского скрипта, т. е. требуется написать код на python, результатом работы которого стал бы аналитический отчет (в excel или txt), взяв в руки который ты, как аналитик, смогла бы понять, можно на таких данных принимать решения или нет (подсказки: найти данные, несопоставимые от периода к периоду, пропущенные и проч.)."
"""

import pandas as pd
import numpy as np
import math
import matplotlib.pyplot as plt

df = pd.read_excel('./Контроль_качества_данных_python.xlsx')

"""Посмотрим на первые 50 строк таблицы."""

df.head(50)

"""Посмотрим информацию о датафрейме."""

df.info()

"""Посмотрим статистические сведения значений о датафрейме."""

df.describe()

"""Проверим данные на дубликаты. """

df.duplicated()

print("Количество дубликатов - {} шт.".format(df.duplicated().sum()))

"""Посмотрим на количество уникальных значений."""

for column in df.columns:
  print("Колонка {0} содержит {1} уникальных значений.".format(column, df[column].nunique()))

"""Посмотрим рассматриваемый период."""

print("Минимальная дата - {}".format(df['Период'].min()))
print("Максимальная дата - {}".format(df['Период'].max()))

"""Проверим количество различных записей, группируя по отделам."""

df.groupby('Отдел')['Показатель'].count()

df.groupby('Отдел')['Период'].count()

df.groupby('Отдел')['Значение_1'].count()

"""**В подразделениях 1 и 7 'Значение_1' различно от количества показателей.** """

df.groupby('Отдел')['Значение_2'].count()

"""**В подразделении 1 'Значение_2' различно от количества показателей.**

**Можно сделать вывод о том, что:**

1.   В показателе "Значение 1" в первом подразделении - 1 отсутствует 3 записи, в подразделении - 7 отсутствует 1 запись
2.   В показателе "Значение 2" в первом подразделении - 1 отсутствует 3 записи

**Посмотрим в каких строках значения отсутствуют.**
"""

bool_series = pd.isnull(df["Значение_2"]) 
df[bool_series]

bool_series = pd.isnull(df["Значение_1"]) 
df[bool_series]

"""Посмотрим количество показателей в различных отделах."""

df.groupby('Отдел')['Показатель'].count()

"""Посмотрим на значения в 'Значение_1' и 'Значение_2'."""

df['Значение_1'].hist()

df['Значение_1'].count()

"""**Посмотрев на гистограмму, мы легко можем сказать, что из 3318 значений показателя "Значение_1" большая часть значений находятся в интервале от 0 до 0,1.**"""

df['Значение_2'].hist()

df['Значение_2'].count()

"""**Посмотрев на гистограмму, мы легко можем сказать, что из 3319 значений показателя "Значение_2" большая часть значений находятся также в интервале от 0 до 0,1.**

Посмотрим на различие суммы значений 'Значение_1' и 'Значение_2' в отделах.
"""

plt.figure(figsize=(30, 5), dpi=160)

hehe = df.groupby('Отдел').agg({'Значение_1':'sum'}).reset_index()
plt.plot(hehe['Отдел'],hehe['Значение_1'])

hehe = df.groupby('Отдел').agg({'Значение_2':'sum'}).reset_index()
plt.plot(hehe['Отдел'],hehe['Значение_2'])

"""Посмотрим на различие суммы значений 'Значение_1' и 'Значение_2' в различные временные периоды."""

plt.figure(figsize=(30, 5), dpi=160)

hehe = df.groupby('Период').agg({'Значение_1':'sum'}).reset_index()
plt.plot(hehe['Период'],hehe['Значение_1'])

hehe = df.groupby('Период').agg({'Значение_2':'sum'}).reset_index()
plt.plot(hehe['Период'],hehe['Значение_2'])

"""Посмотрим, если закономерность в распределении значений по отделам."""

import plotly.express as px
fig = px.scatter(df, x='Значение_1', y='Значение_2', color='Отдел')
fig.show()

"""Закономерности нет.

Посмотрим распределения значений в отделах.
"""

df.plot(x = 'Значение_1', 
        y = 'Отдел', 
        kind = 'scatter', 
        grid = True, 
        title = 'Значения в отделах')

df.plot(x = 'Значение_2', 
        y = 'Отдел', 
        kind = 'scatter', 
        grid = True, 
        title = 'Значения в отделах')

"""Распределения "Значение_1" и "Значение_2" по отделам схожи.

Посмотрим распределения значений в различные временные периоды.
"""

df.plot(x = 'Значение_1', 
        y = 'Период', 
        kind = 'scatter', 
        grid = True, 
        title = 'Значения в отделах')

df.plot(x = 'Значение_2', 
        y = 'Период', 
        kind = 'scatter', 
        grid = True, 
        title = 'Значения в отделах')

"""Посмотрев, на распределения "Значение_1" и "Значение_2" в различные временные периоды закономерность можно увидеть только во втором показателе.

Посмотрим на средние значения в отделах.
"""

df.pivot_table(values = ['Значение_1', 'Значение_2'], 
               index = 'Отдел', 
               aggfunc = 'mean').plot(kind = 'bar')

"""Посмотрим на средние значения в разные периоды времени."""

df.pivot_table(values = ['Значение_1', 'Значение_2'], 
               index = 'Период', 
               aggfunc = 'mean').plot(kind = 'bar')

"""Вывод: 

---

Строки, в которых присутствовали пропущенные значения, нашла.

---

Предоставленные данные схожи по статистическим показателям.

Группируя значения по отделам, глобальных различий не наблюдается.

Анализ необходимо проводить, разделив данные на определенные временные периоды.
"""